[
    {
      "Type": "DeadStar",
      "Title": "A Long Dead Star",
      "Body": "As your ship drifts through the void, you find yourself in the haunting presence of a long-dead star. The once radiant celestial Body now lies dormant, its light extinguished eons ago. \nThe star's husk, a frozen remnant of its former glory, casts an eerie, ghostly glow. It's as if the star's dying breath lingers in the vacuum, a reminder of the inevitable fate that awaits all things in the cosmos.",
      "Choice1Text": "Syphon the remaining energy from star.\nFuel + 10\n\nA melancholy falls upon the crew.\nMorale - 5",
      "Choice1Effects": {
        "Fuel": 10,
        "Morale": -5
      },
      "Choice2Text": "Take a moment of silence and move on.",
      "Choice2Effects": {
        "Fuel": 0
      }
    },    
    {
        "Type": "DeadStar",
        "Title": "A Dead Star",
        "Body": "The once radiant celestial body now lies dormant, its light extinguished eons ago. \nThe star’s husk, a frozen remnant of its former glory, casts an eerie, ghostly glow.\nIt’s as if the star's dying breath lingers in the vacuum, a reminder of the inevitable fate that awaits all things in the cosmos.",
        "Choice1Text": "Sadness takes hold of the crew at this sight \nMoral -5",
        "Choice1Effects": {
          "Morale": -5
        },
        "Choice2Text": "Turn the ship so the crew do not see. \nFuel -5",
        "Choice2Effects": {
          "Fuel": -5
        }
    },
    {
        "Type": "DeadStar",
        "Title": "A Desolate and Dead Star",
        "Body": "As you observe the dead star, a sense of melancholy washes over you. \nThe silence is deafening, a void that even your ship’s engines seem reluctant to disturb. \nThere is nothing here but the ghosts of a past long gone, a solemn reminder that even stars are not eternal.",
        "Choice1Text": "Its all too much... \nMoral -5",
        "Choice1Effects": {
          "Morale": -5
        },
        "Choice2Text": "There is no meaning... \nMorale -5",
        "Choice2Effects": {
          "Morale": -5
        }
    },
    {
      "Type": "Belt",
      "Title": "Mineral Field",
      "Body": "Your ship enters an asteroid field, a chaotic region where countless fragments of shattered worlds drift aimlessly through space. The asteroids vary in size, from dust particles to colossal boulders, each scarred by eons of collisions and cosmic erosion. Some of the larger ones bear deep craters, remnants of ancient impacts, while others glisten with veins of precious minerals, their surfaces a patchwork of colors and textures.",
      "Choice1Text": "That crater resembles a face! \nMorale + 5",
      "Choice1Effects": {
        "Moral": 5
      },
      "Choice2Text": "Mine the minerals. \n Fuel + 5 \n( will be different resource)",
      "Choice2Effects": {
        "Fuel": 5
      }
    },
    {
      "Type": "Belt",
      "Title": "Asteroid Belt X2516b",
      "Body": "The belt is a symphony of motion, with rocks spinning and tumbling in all directions. It’s as if you’ve entered a cosmic scrapyard, where the remnants of failed planets and forgotten moons have gathered, bound together in a turbulent dance by the gravitational forces of long-dead celestial bodies. Your ship’s sensors beep constantly, warning of potential collisions as you navigate through the dense field.You catch sight of something unusual — a derelict ship, long abandoned and half-buried in the side of an asteroid...",
      "Choice1Text": "Salvage the derelict for parts! \nFuel + 10 \n( will be different)",
      "Choice1Effects": {
        "Fuel": 5
      },
      "Choice2Text": "Say a prayer for the brave souls who were lost here. \n Morale + 5",
      "Choice2Effects": {
        "Morale": 5
      }
    },
    {
      "Type": "MStar",
      "Title": "M Class Star S5124c",
      "Body": "Your ship approaches the M-class star, a crimson giant burning with a steady, ancient glow. The star’s surface churns with slow, simmering activity, its deep red hue a stark contrast to the cold void of space around it. This star, though smaller and cooler than its more energetic siblings, is a lifeblood for those who know how to harness its power. Its energy is abundant, a slow-burning furnace that has endured for billions of years and will continue to do so long after your journey is over",
      "Choice1Text": "Scoop fuel from the star \nFuel + 20",
      "Choice1Effects": {
        "Fuel": 20
      },
      "Choice2Text": "Give a crew a moments respite. \n Morale + 5",
      "Choice2Effects": {
        "Morale": 5
      }
    },
    {
      "Type": "MStar",
      "Title": "M Class Star f112u",
      "Body": "Your ship approaches the M-class star. Despite its age, the M-class star exudes a quiet, enduring strength. It pulses with the rhythm of a celestial heartbeat, each wave of energy a reminder of the vast reserves of power just beneath its surface. Your ship’s systems hum with renewed life as they draw from the star’s immense reserves, the fuel gauges steadily climbing as the star willingly shares its ancient energy.",
      "Choice1Text": "Short Fuel Scoop \nFuel + 15",
      "Choice1Effects": {
        "Fuel": 15
      },
      "Choice2Text": "Double Shifts, we need to resupply. \n Fuel + 25 \nMorale - 5",
      "Choice2Effects": {
        "Morale": -5,
        "Fuel": 25
      }
    },
    {
      "Type": "MStar",
      "Title": "M Class Star w9952o",
      "Body": "There’s a sense of reverence as you orbit this stellar giant, a feeling that you’re tapping into something primordial and timeless. This star has fueled countless journeys before yours, and it will continue to do so, a beacon of sustenance in the deep, dark reaches of space.",
      "Choice1Text": "Scoop fuel from the star \nFuel + 10",
      "Choice1Effects": {
        "Fuel": 10
      },
      "Choice2Text": "Witness the stars majesty \nMorale + 5",
      "Choice2Effects": {
        "Morale": 5  
      }
    }
  ]